Revit 2026 API

# MetalMetalPerforationsShader Property

---

The property labeled "Image" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPerforationsShader { get; }
```
```vb
Public Shared ReadOnly Property MetalPerforationsShader As String
	Get
```
```cpp
public:
static property String^ MetalPerforationsShader {
	String^ get ();
}
```
```fsharp
static member MetalPerforationsShader : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace